compressible/resonators/axisymmetric/sonicFoam/tkachenko/f=1_l=0.015/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            patch;
        nFaces          50;
        startFace       9850;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       9900;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       9950;
    }
    bottom_axis
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       10050;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10000;
        startFace       10150;
    }
)

// ************************************************************************* //
