compressible/resonators/axisymmetric/sonicFoam/tkachenko/f=1_l=0.015/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     sonicFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime 	0.610832;// 100 Tw

deltaT          5.4e-07;// Co=0.8

writeControl    timeStep;

writeInterval   376.3888;// Tw/dt/30

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

maxCo 0.99;

adjustTimeStep  yes;

maxDeltaT       5.4e-07;// Co=0.8

//Output
functions
{
    probes
    {
        libs            ("libsampling.so");
        type            probes;
        name            probes;
        writeControl    timeStep;
        writeInterval   1;
        fields          (p);
        probeLocations
        (
            (0 0 0)
            // (0.85 0 0)
            // (1.7 0 0)
        );
    }
}
